minor fixes in documentation
